In [5]:
import pandas as pd 

data = {"Name": ['Amirah', 'Nazrin', 'Ridhwan'],
        'Age': [27, 26, 30], 
        'city': ['Puncak Alam', 'Sentul', 'Ampang'],
        'work': ['Teacher', 'Data analyst', 'Finance trader']}


df = pd.DataFrame(data)

In [6]:
df.head()

      Name  Age         city            work
0   Amirah   27  Puncak Alam         Teacher
1   Nazrin   26       Sentul    Data analyst
2  Ridhwan   30       Ampang  Finance trader

In [8]:
df.describe()

             Age
count   3.000000
mean   27.666667
std     2.081666
min    26.000000
25%    26.500000
50%    27.000000
75%    28.500000
max    30.000000

In [19]:
df.Name
df.Age

0    27
1    26
2    30
Name: Age, dtype: int64

In [20]:
df[df['Age'] < 30 ]

     Name  Age         city          work
0  Amirah   27  Puncak Alam       Teacher
1  Nazrin   26       Sentul  Data analyst

In [25]:
df.sort_values(by= 'Age', ascending = True)
#df.sort_values(by= 'Age', ascending = False)

      Name  Age         city            work
1   Nazrin   26       Sentul    Data analyst
0   Amirah   27  Puncak Alam         Teacher
2  Ridhwan   30       Ampang  Finance trader